tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_gpio.h
/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define  GPIO_BRR_BR0_Pos                         (0)
#define  GPIO_BRR_BR0_Msk                         (0x01U << GPIO_BRR_BR0_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR1_Pos                         (1)
#define  GPIO_BRR_BR1_Msk                         (0x01U << GPIO_BRR_BR1_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR2_Pos                         (2)
#define  GPIO_BRR_BR2_Msk                         (0x01U << GPIO_BRR_BR2_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR3_Pos                         (3)
#define  GPIO_BRR_BR3_Msk                         (0x01U << GPIO_BRR_BR3_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR4_Pos                         (4)
#define  GPIO_BRR_BR4_Msk                         (0x01U << GPIO_BRR_BR4_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR5_Pos                         (5)
#define  GPIO_BRR_BR5_Msk                         (0x01U << GPIO_BRR_BR5_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR6_Pos                         (6)
#define  GPIO_BRR_BR6_Msk                         (0x01U << GPIO_BRR_BR6_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR7_Pos                         (7)
#define  GPIO_BRR_BR7_Msk                         (0x01U << GPIO_BRR_BR7_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR8_Pos                         (8)
#define  GPIO_BRR_BR8_Msk                         (0x01U << GPIO_BRR_BR8_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR9_Pos                         (9)
#define  GPIO_BRR_BR9_Msk                         (0x01U << GPIO_BRR_BR9_Pos)                       /*!<Port Reset bit*/
#define  GPIO_BRR_BR10_Pos                        (10)
#define  GPIO_BRR_BR10_Msk                        (0x01U << GPIO_BRR_BR10_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BRR_BR11_Pos                        (11)
#define  GPIO_BRR_BR11_Msk                        (0x01U << GPIO_BRR_BR11_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BRR_BR12_Pos                        (12)
#define  GPIO_BRR_BR12_Msk                        (0x01U << GPIO_BRR_BR12_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BRR_BR13_Pos                        (13)
#define  GPIO_BRR_BR13_Msk                        (0x01U << GPIO_BRR_BR13_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BRR_BR14_Pos                        (14)
#define  GPIO_BRR_BR14_Msk                        (0x01U << GPIO_BRR_BR14_Pos)                      /*!<Port Reset bit*/
#define  GPIO_BRR_BR15_Pos                        (15)
#define  GPIO_BRR_BR15_Msk                        (0x01U << GPIO_BRR_BR15_Pos)                      /*!<Port Reset bit*/

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define  GPIO_LCKR_LCK0_Pos                       (0)
#define  GPIO_LCKR_LCK0_Msk                       (0x01U << GPIO_LCKR_LCK0_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK1_Pos                       (1)
#define  GPIO_LCKR_LCK1_Msk                       (0x01U << GPIO_LCKR_LCK1_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK2_Pos                       (2)
#define  GPIO_LCKR_LCK2_Msk                       (0x01U << GPIO_LCKR_LCK2_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK3_Pos                       (3)
#define  GPIO_LCKR_LCK3_Msk                       (0x01U << GPIO_LCKR_LCK3_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK4_Pos                       (4)
#define  GPIO_LCKR_LCK4_Msk                       (0x01U << GPIO_LCKR_LCK4_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK5_Pos                       (5)
#define  GPIO_LCKR_LCK5_Msk                       (0x01U << GPIO_LCKR_LCK5_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK6_Pos                       (6)
#define  GPIO_LCKR_LCK6_Msk                       (0x01U << GPIO_LCKR_LCK6_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK7_Pos                       (7)
#define  GPIO_LCKR_LCK7_Msk                       (0x01U << GPIO_LCKR_LCK7_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK8_Pos                       (8)
#define  GPIO_LCKR_LCK8_Msk                       (0x01U << GPIO_LCKR_LCK8_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK9_Pos                       (9)
#define  GPIO_LCKR_LCK9_Msk                       (0x01U << GPIO_LCKR_LCK9_Pos)                     /*!<Lock bit*/
#define  GPIO_LCKR_LCK10_Pos                      (10)
#define  GPIO_LCKR_LCK10_Msk                      (0x01U << GPIO_LCKR_LCK10_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCK11_Pos                      (11)
#define  GPIO_LCKR_LCK11_Msk                      (0x01U << GPIO_LCKR_LCK11_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCK12_Pos                      (12)
#define  GPIO_LCKR_LCK12_Msk                      (0x01U << GPIO_LCKR_LCK12_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCK13_Pos                      (13)
#define  GPIO_LCKR_LCK13_Msk                      (0x01U << GPIO_LCKR_LCK13_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCK14_Pos                      (14)
#define  GPIO_LCKR_LCK14_Msk                      (0x01U << GPIO_LCKR_LCK14_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCK15_Pos                      (15)
#define  GPIO_LCKR_LCK15_Msk                      (0x01U << GPIO_LCKR_LCK15_Pos)                    /*!<Lock bit*/
#define  GPIO_LCKR_LCKK_Pos                       (16)
#define  GPIO_LCKR_LCKK_Msk                       (0x01U << GPIO_LCKR_LCKK_Pos)                     /*!<Lock key*/

/**
  * @brief GPIO_DCR Register Bit Definition
  */
#define  GPIO_DCR_PX0_Pos                         (0)
#define  GPIO_DCR_PX0_Msk                         (0x03U << GPIO_DCR_PX0_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX1_Pos                         (2)
#define  GPIO_DCR_PX1_Msk                         (0x03U << GPIO_DCR_PX1_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX2_Pos                         (4)
#define  GPIO_DCR_PX2_Msk                         (0x03U << GPIO_DCR_PX2_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX3_Pos                         (6)
#define  GPIO_DCR_PX3_Msk                         (0x03U << GPIO_DCR_PX3_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX4_Pos                         (8)
#define  GPIO_DCR_PX4_Msk                         (0x03U << GPIO_DCR_PX4_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX5_Pos                         (10)
#define  GPIO_DCR_PX5_Msk                         (0x03U << GPIO_DCR_PX5_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX6_Pos                         (12)
#define  GPIO_DCR_PX6_Msk                         (0x03U << GPIO_DCR_PX6_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX7_Pos                         (14)
#define  GPIO_DCR_PX7_Msk                         (0x03U << GPIO_DCR_PX7_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX8_Pos                         (16)
#define  GPIO_DCR_PX8_Msk                         (0x03U << GPIO_DCR_PX8_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX9_Pos                         (18)
#define  GPIO_DCR_PX9_Msk                         (0x03U << GPIO_DCR_PX9_Pos)                       /*!<PX:*/
#define  GPIO_DCR_PX10_Pos                        (20)
#define  GPIO_DCR_PX10_Msk                        (0x03U << GPIO_DCR_PX10_Pos)                      /*!<PX:*/
#define  GPIO_DCR_PX11_Pos                        (22)
#define  GPIO_DCR_PX11_Msk                        (0x03U << GPIO_DCR_PX11_Pos)                      /*!<PX:*/
#define  GPIO_DCR_PX12_Pos                        (24)
#define  GPIO_DCR_PX12_Msk                        (0x03U << GPIO_DCR_PX12_Pos)                      /*!<PX:*/
#define  GPIO_DCR_PX13_Pos                        (26)
#define  GPIO_DCR_PX13_Msk                        (0x03U << GPIO_DCR_PX13_Pos)                      /*!<PX:*/
#define  GPIO_DCR_PX14_Pos                        (28)
#define  GPIO_DCR_PX14_Msk                        (0x03U << GPIO_DCR_PX14_Pos)                      /*!<PX:*/
#define  GPIO_DCR_PX15_Pos                        (30)
#define  GPIO_DCR_PX15_Msk                        (0x03U << GPIO_DCR_PX15_Pos)                      /*!<PX:*/

/**
  * @brief GPIO_AFRL Register Bit Definition
  */
#define  GPIO_AFRL_AFR0_Pos                       (0)
#define  GPIO_AFRL_AFR0_Msk                       (0x0FU << GPIO_AFRL_AFR0_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR1_Pos                       (4)
#define  GPIO_AFRL_AFR1_Msk                       (0x0FU << GPIO_AFRL_AFR1_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR2_Pos                       (8)
#define  GPIO_AFRL_AFR2_Msk                       (0x0FU << GPIO_AFRL_AFR2_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR3_Pos                       (12)
#define  GPIO_AFRL_AFR3_Msk                       (0x0FU << GPIO_AFRL_AFR3_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR4_Pos                       (16)
#define  GPIO_AFRL_AFR4_Msk                       (0x0FU << GPIO_AFRL_AFR4_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR5_Pos                       (20)
#define  GPIO_AFRL_AFR5_Msk                       (0x0FU << GPIO_AFRL_AFR5_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR6_Pos                       (24)
#define  GPIO_AFRL_AFR6_Msk                       (0x0FU << GPIO_AFRL_AFR6_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRL_AFR7_Pos                       (28)
#define  GPIO_AFRL_AFR7_Msk                       (0x0FU << GPIO_AFRL_AFR7_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/

/**
  * @brief GPIO_AFRH Register Bit Definition
  */
#define  GPIO_AFRH_AFR8_Pos                       (0)
#define  GPIO_AFRH_AFR8_Msk                       (0x0FU << GPIO_AFRH_AFR8_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR9_Pos                       (4)
#define  GPIO_AFRH_AFR9_Msk                       (0x0FU << GPIO_AFRH_AFR9_Pos)                     /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR10_Pos                      (8)
#define  GPIO_AFRH_AFR10_Msk                      (0x0FU << GPIO_AFRH_AFR10_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR11_Pos                      (12)
#define  GPIO_AFRH_AFR11_Msk                      (0x0FU << GPIO_AFRH_AFR11_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR12_Pos                      (16)
#define  GPIO_AFRH_AFR12_Msk                      (0x0FU << GPIO_AFRH_AFR12_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR13_Pos                      (20)
#define  GPIO_AFRH_AFR13_Msk                      (0x0FU << GPIO_AFRH_AFR13_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR14_Pos                      (24)
#define  GPIO_AFRH_AFR14_Msk                      (0x0FU << GPIO_AFRH_AFR14_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/
#define  GPIO_AFRH_AFR15_Pos                      (28)
#define  GPIO_AFRH_AFR15_Msk                      (0x0FU << GPIO_AFRH_AFR15_Pos)                    /*!<Port x alternate function bit, which can be accessed by software to configure the function.*/


#endif

